app/controllers/proposals_controller.rb

SELECT * FROM "proposals" WHERE ((proposals.closing_at > '2010-08-14 15:22:38') AND ((proposals.status = 'open') AND (proposals.opening_at < '2010-08-14 15:22:38')))
SELECT "votes".* FROM "votes" WHERE ("votes".proposal_id IN (1,2,3,4))
SELECT * FROM "proposals" WHERE ((proposals.closing_at > '2010-08-15 20:29:19') AND ((proposals.opening_at < '2010-08-15 20:29:19') AND (proposals.status = 'open'))) ORDER BY proposals.opening_at ASC LIMIT 30 OFFSET 0
SELECT * FROM "users" LIMIT 1
SELECT count(*) AS count_all FROM "proposals" WHERE (proposals.user_id = 1)
SELECT * FROM "signatures" WHERE ((signatures.proposal_id = 1 OR signatures.proposal_id = 2 OR signatures.proposal_id = 3 OR signatures.proposal_id = 4 OR signatures.proposal_id = 5 OR signatures.proposal_id = 6 OR signatures.proposal_id = 7 OR signatures.proposal_id = 8 OR signatures.proposal_id = 9 OR signatures.proposal_id = 10 OR signatures.proposal_id = 11) AND (signatures.user_id = 1))
---
  def index
     @search = Proposal.search(params[:search])
     @proposals = @search.paginate(:page=>params[:page], :per_page=>5, :include => [:user, :votes, :cancelled_by])
     @my_signatures = Signature.user_id_eq(current_user.id).proposal_id_in(@proposals).all

SELECT * FROM "proposals" WHERE ("proposals"."id" = 1)
UPDATE "proposals" SET "updated_at" = '2010-08-15 10:26:36', "status" = 'withdrawn' WHERE "id" = 1
---
  def withdraw
    @proposal = Proposal.find(params[:id])
    if current_user.id == @proposal.user_id && @proposal.status=='open' && @proposal.closing_at > Time.now
      @proposal.status='withdrawn'
      @proposal.save